using System.Diagnostics;
using QuestPDF.Fluent;
using QuestPDF.Helpers;
using QuestPDF.Infrastructure;
using SkiaSharp;

const float A4_WIDTH = 595;
const float A4_HEIGHT = 842;



// using var document = SKDocument.CreatePdf("./mypdf.pdf");
// using var canvas = document.BeginPage(A4_WIDTH, A4_HEIGHT);
string longText = 
"""
 	كونوا جزءاً من المساهمة في مشروع المليون ويكي
ساهموا معنا في الوصول إلى مليون تعديل — كل مساهمة تُحدث فرقاً! 	
المحتويات
المقدمة
الأصل والتطوّر

        المعيار
        أنظمة الكتابة المغطاة
    انظر ايضًا
    المراجع
    وصلات خارجية

الترميز الموحد

    مقالة
    نقاش

    اقرأ
    عدّل
    تاريخ

أدوات

المظهر
النص

    صغير
    قياسي
    كبير

العرض

    قياسي
    عريض

اللون (تجريبية)

    تلقائي
    فاتح
    داكن

يونيكود
الشعار
معلومات عامةموقع الويب	
unicode.org (الإنجليزية) عدل القيمة على Wikidata
التسلسلمأخوذ عن	
  القائمة ...
ترجم
ترجمعدل القيمة على Wikidata

تعديل - تعديل مصدري - تعديل ويكي بياناتحول القالب
تتضمن هذه المقالة محارف خاصة. من غير تصيير مناسب، قد تظهر علامات استفهام أو صناديقَ أو رموزٌ أخرى.
معيار نظام الحروف الدولي الموحد، نسخة 5.0

في علم الحاسوب، الترميز الموحد
(يونيكودأو يُونِكُود) (بالإنجليزية: Unicode) هو معيار يمكن الحواسيب من تمثيل النصوص المكتوبة بأغلب نظم الكتابة ومعالجتها، بصورة متناسقة. يتكون يونيكود من 100,000 محرف، وطقم من مخططات الرموز كمرجع مرئي، ونهج في الترميز، وطقم من ترميزات المحارف المعيارية، وسرد لخصائص المحارف، وطقم من البيانات المرجعية، وعدد من الأمور المتعلقة مثل خصائص المحارف، وقواعد تطبيع النص، وفك الحروف لوحداتها الأولية، والترتيب، والتصيير، وثنائية الاتجاه (لعرض النصوص الذي يحتوي على كتابات من اليمين لليسار، مثل العربية، مع كتابات من اليسار لليمين، مثل اللاتينية).

يطور يونيكود بالتوازي مع معيار طقم المحارف العالمي، وينشر على شكل كتاب يحمل الاسم معيار يونيكود (Unicode Standard).

يطمح مجمع يونيكود -المنظمة غير الربحية التي تنسق تطوير يونيكود- في النهاية إلى استبدال ترميزات المحارف الموجودة حاليا، ليحل محلها يونيكود وتنسيق يونيكود المعياري للتحويل (Unicode Transformation Format ،UTF)، حيث أن الكثير من الترميزات الحالية محدودة السعة والمدى، ولا تتوافق مع البيئات متعددة اللغات.

أدى نجاح يونيكود في توحيد أطقم المحارف إلى انتشار وغلبة استخدامه في توطين وعولمة برمجيات الحاسوب. وجرى تطبيق البرنامج في العديد من التقنيات الحديثة، مثل لغة الترميز القابلة للامتداد، ولغة البرمجة جافا وأنظمة التشغيل الحديثة.
الأصل والتطوّر

يهدف الترميز الموحد بشكل صريح إلى تجاوز القصور في ترميزات المحارف التقليدية، كهؤلاء الذين حددهم معيار آيزو/آي إي سي 8859 وينتشر استخدامهم في مختلف أقطار العالم لكنهم يفتقدون للتوافقية بينهم بشكل كبير.

تشترك الكثير من ترميزات المحارف التقليدية في مشكلة تمكينهم للمعالجة الحاسوبية ثنائية اللغة (عادة باستخدام المحارف اللاتينية بالإضافة للغة المحلية) دون تعددية اللغات (معالجة العديد من اللغات مختلطة مع بعضها، كالعربية والإنجليزية والصينية والهندية في صفحة واحدة).

يُرمِّز يونيكود -عن قصد- المحارف الأصلية (تلك التي تمثل الحروف ذاتها وما شابهها) وليس تنويعات الشكل النهائي (فترمز حرف الخاء في العربية، مثلا، وليس أشكال الخاء المختلفة في أول، أو وسط، أو آخر الكلمة، أو الشكل المنفصل). في حالة المحارف الصينية، يؤدى هذا أحيانا لبعض الخلافات حول تمييز التنويعات الشكلية من الحرف المشكل لها.

يضطلع يونيكود بدور تحديد رمز فريد -رقما، وليس شكلا- لكل محرف. بعبارة أخرى، يمثل يونيكود المحارف بصورة مجرّدة ويترك العرض البصري (الحجم، والشكل، والخط، والأسلوب) لبرمجيات أخرى، مثل متصفح الوب أو معالج الكلمات. على الرغم من بساطة هذا الهدف، فقد أصبح معقدا نتيجة للتنازلات التي قدمها مصمموا يونيكود بغية تشجيع الإسراع في استخدامه.

جُعل أول 256 رمز متطابقين مع محتويات ISO 8859-1 لتبسيط عملية تحويل النصوص الغربية الموجودة مسبقا. العديد من المحارف المتطابقة تم ترميزها العديد من المرات في نقاط ترميز مختلفة للحفاظ على التفريق المُستخدم في الترميزات العتيقة مما يسمح بالتحويل بين هذه الترميزات من وإلى يونيكود دون فقد أي معلومات. على سبيل المثال، قسم «كامل العرض» يحتوي على ألفبائية لاتينية كاملة منفصلة عن قسم الألفبائية اللاتينية. في الخطوط الصينية، واليابانية، والكورية (ص‌ي‌ك)، تعرض هذه المحارف بنفس عرض رموز ص‌ي‌ك بلا من نصف العرض.

عند الكتابة عن يونيكود، تٌمثّل المحارف بكتابة "U+" يليها رقم ست عشري يمثل رمز المحرف.
المعيار

يُطوّر مجمع يونيكود -ومقره كاليفورنيا- معيار يونيكود. الشركات أو الأفراد الراغبون في دفع استحقاقات العضوية يمكنهم الانضمام للمنظمة. يشمل الأعضاء نظريا كل شركات العتاد والبرمجيات الرئيسية التي تهتم بمعايير معالجة النصوص، مثل أدوبي سيستمز، وأبل، وآي.بي.إم، ومايكروسوفت، وهيولت باكرد، وزيروكس وغيرها الكثير.

نشر المجمع معيار يونيكود (ISBN 0-321-18578-1) لأول مرّة في 1991، ويواصل تطوير المعيار بناء على العمل الأصلي. يُطوّر يونيكود بالاشتراك مع المنظمة الدولية للمعايير (أيزو) ويشترك في مخطط المحارف مع ISO/IEC 10646: طقم المحارف العالمي.

يعمل يونيكود و ISO/IEC 10646 كترميزات محارف بشكل متساو، لكن معيار يونيكود يشتمل على الكثير من المعلومات للمطبيقن، ويغطي -بالتفصيل- مواضيع مثل الترتيب (كالترتيب الأبجدي والألفبائي حسب كل لغة)، والتصيير. يسرد ينيكود زخما من خصائص المحارف، كتلك المطلوبة لدعم النصوص ثنائية الاتجاه.

مُراجعات يونيكود حتى الآن:

    يونيكود 1.0: أكتوبر 1991

يونيكود 1.0.1: يناير 1992يونيكود 1.1: يونيو 1993يونيكود 2.0: يوليو 1996
يونيكود 2.1: مايو 1998
يونيكودد 2.1.2: مايو 1998
يونيكود 3.0: سبتمبر 1999. يغطي UCS 16-بتة مستوى يونيكود  ‏ من ISO 10646-1:2000.يونيكود 3.1: مارس 2001. أضاف Supplementary Planes  
‏ من ISO 10646-2، مضيفا المحارف التكميلية
يونيكود 3.2: مارس 2002
يونيكود 4.0: أبريل 2003
يونيكود 4.0.1: مارس 2004
يونيكود 4.1: مارس 2005
يونيكود 5.0: يوليو 2006

    يونيكود 5.1: أبريل 2008

أنظمة الكتابة المغطاة
يُغطي يونيكود تقريبا كل أنظمة الكتابة المستخدمة حاليا.

على الرغم من أن أكثر من 30 نظام كتابة مدرجة في يونيكود، إلا أنه تبقى بعض أنظمة الكتابة التي تنتظر الترميز. كما يتم أيضا إضافة المزيد من المحارف لأنظمة الكتابة المرمّزة بالفعل، وأيضا الرموز مثل الرموز الموسيقية والرياضية.

من ضمن نظم الكتابة التي تنتظر الترميز، الهيروغليفية، البابلية والكتابة المسمارية والأبجدية الفينيقية. مع بعض أنظمة كتابة بعض الأقليات في آسيا وأوروبا وأفريقيا، العديد منها غير مفهوم.
انظر ايضًا

    تصميم طباعة الحروف رقميا
    إدخال محارف الترميز الموحد
    صيغة التحويل الموحد-8

المراجع

وصلة مرجع: https://www.unicode.org/versions/Unicode2.0.0/. لغة العمل أو لغة الاسم: الإنجليزية.
Khaled Hosny (12 يناير 2015). "ما هو الترميز الموحد يونيكود؟". Unicode®. مؤرشف من الأصل في 2021-05-04. اطلع عليه بتاريخ 2021-09-16.
Unicode Transcriptions نسخة محفوظة 22 ديسمبر 2017 على موقع واي باك مشين.
Technical Introduction نسخة محفوظة 27 ديسمبر 2017 على موقع واي باك مشين.
ISBN 0-201-56788-1
ISBN 0-201-60845-6
المنشورين السابقين، والتقرير التقني #4:معيار يونيكود، إصدارة 1.1 بواسطة مارك ديڤيس
99999999999999999999999999
""";

// DrawText(canvas, longText.Split('\n'), new SKRect(10,10, A4_WIDTH-20, A4_HEIGHT-20),new SKPaint(), new SKFont());

// document.Close();



// static void DrawText(SKCanvas canvas, string[] lines, SKRect rect, SKPaint paint, SKFont font)
// {
// 	float spaceWidth = font.MeasureText(" ");
// 	float wordX = rect.Left;
// 	float wordY = rect.Top + font.Size;
//     foreach(var line in lines)
//     {
//         foreach (string word in line.Split(' '))
//         {
//             float wordWidth = font.MeasureText(word);
//             if (wordWidth <= rect.Right - wordX)
//             {
//                 canvas.DrawText(word, wordX, wordY, SKTextAlign.Left, font, paint);
//                 wordX += wordWidth + spaceWidth;
//                 continue;
//             }
//             wordY += font.Spacing;
//             wordX = rect.Left;
//         }
//         wordY += font.Spacing;
//         wordX = rect.Left;        
//     }
// }

QuestPDF.Settings.License = LicenseType.Community;
var pdf = QuestPDF.Fluent.Document.Create(document => {
    document.Page(page => {
        page.Size(PageSizes.A4);
        page.Content().Element(el => {
            el.Column(col => {
                col.Item().Text(longText);
            });
        });
    });
});

pdf.GeneratePdf("./quest.pdf");